"""
3. Пользователь вводит месяц в виде целого числа от 1 до 12.
Сообщить к какому времени года относится месяц (зима, весна, лето, осень).
Напишите решения через list и через dict.
"""

month_number = int(input('Введите номер месяца: '))
seasons_list = ['зима', 'зима', 'весна', 'весна', 'весна', 'лето', 'лето', 'лето', 'осень', 'осень', 'осень', 'зима']
seasons_dict = {1: 'зима', 2: 'зима', 3: 'весна', 4: 'весна', 5: 'весна', 6: 'лето', 7: 'лето', 8: 'лето', 9: 'осень',
                10: 'осень', 11: 'осень', 12: 'зима'}
if month_number in seasons_dict:
    print(seasons_list[month_number - 1])
    print(seasons_dict[month_number])
else:
    print('Нет такого месяца')


# while True:
#     if month_number.isdigit() and 0 < int(month_number) <= 12:
#         season_1 = ['зима', 'весна', 'лето', 'осень', 'зима']
#         season_2 = {0: 'зима', 1: 'весна', 2: 'лето', 3: 'осень', 4: 'зима'}
#         print(
#             f'Список сезонов -{season_1[int(month_number) // 3]}\nСловарь сезонов - {season_2[int(month_number) // 3]}')
#         break
#     else:
#         print('Ошибка!')
